MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NUC029CIG1/mcu.h
    /**
     * TCON
     * ===================================================================================================
     * Offset: 0x80  PWM Trigger Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |PWM0PTEN  |Channel 0 PWM Period Trigger ADC Enable Register
     * |        |          |1 = Enable PWM channel 0 trigger ADC function
     * |        |          |0 = Disable PWM channel 0 trigger ADC function
     * |        |          |As PWM operating at edge-aligned mode, enable this bit can make PWM trigger ADC to start conversion when PWM counter down count to underflow.
     * |        |          |As PWM operating at center-aligned mode, enable this bit can make PWM trigger ADC to start conversion
     * |        |          |when PWM counter up count to (CNR+1) or down count to underflow based on INT01PTYPE setting.
     * |        |          |1 = Enable PWM channel 0 output to pin.
     * |        |          |0 = Disable PWM channel 0 output to pin.
     * |        |          |Note: The corresponding GPIO pin also must be switched to PWM function.
     * |[1]     |PWM1PTEN  |Channel 1 PWM Period Trigger ADC Enable Register
     * |        |          |1 = Enable PWM channel 1 trigger ADC function
     * |        |          |0 = Disable PWM channel 1 trigger ADC function
     * |        |          |As PWM operating at edge-aligned mode, enable this bit can make PWM trigger ADC to start conversion when PWM counter down count to underflow.
     * |        |          |As PWM operating at center-aligned mode, enable this bit can make PWM trigger ADC to start conversion
     * |        |          |when PWM counter up count to (CNR+1) or down count to underflow based on INT01PTYPE setting.
     * |[2]     |PWM2PTEN  |Channel 2 PWM Period Trigger ADC Enable Register
     * |        |          |1 = Enable PWM channel 2 trigger ADC function
     * |        |          |0 = Disable PWM channel 2 trigger ADC function
     * |        |          |As PWM operating at edge-aligned mode, enable this bit can make PWM trigger ADC to start conversion when PWM counter down count to underflow.
     * |        |          |As PWM operating at center-aligned mode, enable this bit can make PWM trigger ADC to start conversion
     * |        |          |when PWM counter up count to (CNR+1) or down count to underflow based on INT23PTYPE setting.
     * |[3]     |PWM3PTEN  |Channel 3 PWM Period Trigger ADC Enable Register
     * |        |          |1 = Enable PWM channel 3 trigger ADC function
     * |        |          |0 = Disable PWM channel 3 trigger ADC function
     * |        |          |As PWM operating at edge-aligned mode, enable this bit can make PWM trigger ADC to start conversion when PWM counter down count to underflow.
     * |        |          |As PWM operating at center-aligned mode, enable this bit can make PWM trigger ADC to start conversion
     * |        |          |when PWM counter up count to (CNR+1) or down count to underflow based on INT23PTYPE setting.
     * |[8]     |PWM0DTEN  |Channel 0 PWM Duty Trigger ADC Enable Register
     * |        |          |1 = Enable PWM channel 0 trigger ADC function
     * |        |          |0 = Disable PWM channel 0 trigger ADC function
     * |        |          |As PWM operating at edge-aligned mode, enable this bit can make PWM trigger ADC to start conversion when PWM counter down count to match CMR.
     * |        |          |As PWM operating at center-aligned mode, enable this bit can make PWM trigger ADC to start conversion
     * |        |          |when PWM counter up count or down count to match CMR based on INT01DTYPE setting.
     * |[9]     |PWM1DTEN  |Channel 1 PWM Duty Trigger ADC Enable Register
     * |        |          |1 = Enable PWM channel 1 trigger ADC function
     * |        |          |0 = Disable PWM channel 1 trigger ADC function
     * |        |          |As PWM operating at edge-aligned mode, enable this bit can make PWM trigger ADC to start conversion when PWM counter down count to match CMR.
     * |        |          |As PWM operating at center-aligned mode, enable this bit can make PWM trigger ADC to start conversion
     * |        |          |when PWM counter up count or down count to match CMR based on INT01DTYPE setting.
     * |[10]    |PWM2DTEN  |Channel 2 PWM Duty Trigger ADC Enable Register
     * |        |          |1 = Enable PWM channel 2 trigger ADC function
     * |        |          |0 = Disable PWM channel 2 trigger ADC function
     * |        |          |As PWM operating at edge-aligned mode, enable this bit can make PWM trigger ADC to start conversion when PWM counter down count to match CMR.
     * |        |          |As PWM operating at center-aligned mode, enable this bit can make PWM trigger ADC to start conversion
     * |        |          |when PWM counter up count or down count to match CMR based on INT23DTYPE setting.
     * |[11]    |PWM3DTEN  |Channel 3 PWM Duty Trigger ADC Enable Register
     * |        |          |1 = Enable PWM channel 3 trigger ADC function
     * |        |          |0 = Disable PWM channel 3 trigger ADC function
     * |        |          |As PWM operating at edge-aligned mode, enable this bit can make PWM trigger ADC to start conversion when PWM counter down count to match CMR.
     * |        |          |As PWM operating at center-aligned mode, enable this bit can make PWM trigger ADC to start conversion
     * |        |          |when PWM counter up count or down count to match CMR based on INT23DTYPE setting.
     */
    __IO uint32_t TCON;

    /**
     * TSTATUS
     * ===================================================================================================
     * Offset: 0x84  PWM Trigger Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |PWM0TF    |PWM Channel 0 Trigger ADC Flag
     * |        |          |This bit is set to 1 by hardware when PWM0 trigger ADC condition matched. As this bit is set to 1,
     * |        |          |ADC will start conversion if ADC triggered source is selected by PWM.
     * |        |          |Software can write 1 to clear this bit.
     * |[1]     |PWM1TF    |PWM Channel 1 Trigger ADC Flag
     * |        |          |This bit is set to 1 by hardware when PWM1 trigger ADC condition matched. As this bit is set to 1,
     * |        |          |ADC will start conversion if ADC triggered source is selected by PWM.
     * |        |          |Software can write 1 to clear this bit.
     * |[2]     |PWM2TF    |PWM Channel 2 Trigger ADC Flag
     * |        |          |This bit is set to 1 by hardware when PWM2 trigger ADC condition matched. As this bit is set to 1,
     * |        |          |ADC will start conversion if ADC triggered source is selected by PWM.
     * |        |          |Software can write 1 to clear this bit.
     * |[3]     |PWM3TF    |PWM Channel 3 Trigger ADC Flag
     * |        |          |This bit is set to 1 by hardware when PWM3 trigger ADC condition matched. As this bit is set to 1,
     * |        |          |ADC will start conversion if ADC triggered source is selected by PWM.
     * |        |          |Software can write 1 to clear this bit.
     */
    __IO uint32_t TSTATUS;

    /**
     * RESERVE2
     * ===================================================================================================
     *
     * ---------------------------------------------------------------------------------------------------
     */
    __I  uint32_t  RESERVE2[4];

    /**
     * PSCR
     * ===================================================================================================
     * Offset: 0x98  PWM Synchronous Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[8]     |PSSEN1    |PWM1 Synchronous Start Enable
     * |        |          |1 = PWM1 synchronous start enable.
     * |        |          |0 = PWM1 synchronous start disable.
     * |        |          |If this bit is set to 1, PWM-Timer1 will synchronous start with PWM-Timer0 when SW writes 1 to PCR.CH0EN in PWM group A.
     * |[16]    |PSSEN2    |PWM2 Synchronous Start Enable
     * |        |          |1 = PWM2 synchronous start enable.
     * |        |          |0 = PWM2 synchronous start disable.
     * |        |          |If this bit is set to 1, PWM-Timer2 will synchronous start with PWM-Timer0 when SW writes 1 to PCR.CH0EN in PWM group A.
     * |[24]    |PSSEN3    |PWM3 Synchronous Start Enable
     * |        |          |1 = PWM3 synchronous start enable.
     * |        |          |0 = PWM3 synchronous start disable.
     * |        |          |If this bit is set to 1, PWM-Timer3 will synchronous start with PWM-Timer0 when SW writes 1 to PCR.CH0EN in PWM group A.
     */
    __IO uint32_t PSCR;

} PWM_T;

/** @addtogroup PWM_CONST PWM Bit Field Definition
  Constant Definitions for PWM Controller
  @{
 */

/* PWM PPR Bit Field Definitions */
#define PWM_PPR_DZI23_Pos                       24                                  /*!< PWM PPR: DZI23 Position */
#define PWM_PPR_DZI23_Msk                       (0xFFul << PWM_PPR_DZI23_Pos)       /*!< PWM PPR: DZI23 Mask */

